d-ronin/dRonin/flight/PiOS/STM32/pios_servo.c
#define CLEAR_BITS(gpio, bits) do { (gpio)->BSRR = ((uint32_t) bits) << 16; } while (0)
#define SET_BITS(gpio, bits) do { (gpio)->BSRR = bits; } while (0)
#endif

		// Start pulse by writing to BSRRL's
		SET_BITS(GPIOA, a);
		SET_BITS(GPIOB, b);
		SET_BITS(GPIOC, c);

		// Calculate falling edge time for 0's
		uint32_t next_tick = start_cycle + time_0;

		// And preload next values before waiting
		a = dshot_msg_zeroes[i][DS_GPIOA];
		b = dshot_msg_zeroes[i][DS_GPIOB];
		c = dshot_msg_zeroes[i][DS_GPIOC];

		PIOS_INLINEDELAY_TillCycleCnt(next_tick);

		// Generate falling edges for zeroes (shorter pulses)
		CLEAR_BITS(GPIOA, a);
		CLEAR_BITS(GPIOB, b);
		CLEAR_BITS(GPIOC, c);

		// Calculate falling edge time for 1's
		next_tick = start_cycle + time_1;

		// Adjust next cycle time for when next bit should begin
		start_cycle += time_tot;

		// And next time, all bits will fall (no harm in doing twice for
		// the 0 bits)
		a = dshot_bits[DS_GPIOA];
		b = dshot_bits[DS_GPIOB];
		c = dshot_bits[DS_GPIOC];

		PIOS_INLINEDELAY_TillCycleCnt(next_tick);

		// Falling edges for all remaining bits.
		CLEAR_BITS(GPIOA, a);
		CLEAR_BITS(GPIOB, b);
		CLEAR_BITS(GPIOC, c);
	}

	PIOS_IRQ_Enable();

	return 0;
}
#endif /* !STM32F0xx */

/**
* Update the timer for HPWM/OneShot
*/
void PIOS_Servo_Update(void)
{
	if (!servo_cfg) {
		return;
	}

	// If some banks are oneshot and some are dshot (why would you do this?)
	// get the oneshots firing first.
	for (uint8_t i = 0; i < servo_cfg->num_channels; i++) {
		if (channel_mask & (1 << 1)) {
			continue;
		}

		if (output_channels[i].mode != SYNC_PWM) {
			continue;
		}

		const struct pios_tim_channel * chan = &servo_cfg->channels[i];

		/* Look for a disabled timer using synchronous output */
		if (!(chan->timer->CR1 & TIM_CR1_CEN)) {
			/* enable it again and reinitialize it */
			TIM_GenerateEvent(chan->timer, TIM_EventSource_Update);
			TIM_Cmd(chan->timer, ENABLE);
		}
	}

#if defined(PIOS_INCLUDE_DMASHOT)
	// Do it before bitbanging, so the updates line up +/-.
	if (PIOS_DMAShot_IsReady()) {
		PIOS_DMAShot_TriggerUpdate();
	}
#endif

	if (dshot_in_use) {
		if (DSHOT_Update()) {
			dshot_in_use = false;
		}
	}
}

/**
 * @brief Determines the APB clock used by a given timer
 * @param[in] timer Pointer to the base register of the timer to check
 * @retval Clock frequency in Hz
 */

#if defined(STM32F0XX) /* F0 */
static uint32_t timer_apb_clock(TIM_TypeDef *timer)
{
	return PIOS_PERIPHERAL_APB1_CLOCK;
}

#elif defined(STM32F10X_MD) /* F1 */

static uint32_t timer_apb_clock(TIM_TypeDef *timer)
{
	if (timer == TIM1 || timer == TIM8)
		return PIOS_PERIPHERAL_APB2_CLOCK;
	else
		return PIOS_PERIPHERAL_APB1_CLOCK;
}

#elif defined(STM32F30X) /* F3 */

static uint32_t timer_apb_clock(TIM_TypeDef *timer)
{
	if (timer == TIM2 || timer == TIM3 || timer == TIM4)
		return PIOS_PERIPHERAL_APB1_CLOCK;
	else
		return PIOS_PERIPHERAL_APB2_CLOCK;
}

#elif defined(STM32F40_41xxx) || defined(STM32F446xx) /*  F4 */

static uint32_t timer_apb_clock(TIM_TypeDef *timer)
{
	if (timer == TIM1 || timer == TIM8 || timer == TIM9 || timer == TIM10 || timer == TIM11)
		return PIOS_PERIPHERAL_APB2_CLOCK;
	else
		return PIOS_PERIPHERAL_APB1_CLOCK;
}

#else
#error Unsupported microcontroller
#endif

/**
 * Prepare for IAP reset.  Stop PWM, so ESCs disarm.
 */
void PIOS_Servo_PrepareForReset() {
	resetting = true;
}

/**
 * @brief Determines the maximum clock rate for a given timer (i.e. no prescale)
 * @param[in] timer Pointer to the base register of the timer to check
 * @retval Clock frequency in Hz
 */
static uint32_t max_timer_clock(TIM_TypeDef *timer)
{
	if (timer == TIM6 || timer == TIM7) {
		// TIM6 and TIM7 cannot be used
		PIOS_Assert(0);
		return 0;
	}

	// "The timer clock frequencies are automatically fixed by hardware. There are two cases:
	//    1. if the APB prescaler is 1, the timer clock frequencies are set to the same frequency as
	//    that of the APB domain to which the timers are connected.
	//    2. otherwise, they are set to twice (*2) the frequency of the APB domain to which the
	//    timers are connected."
	uint32_t apb_clock = timer_apb_clock(timer);
	if (apb_clock == PIOS_SYSCLK)
		return apb_clock;
	else
		return apb_clock * 2;
}

/*
 * @}
 * @}
 */
